2018/io-redirect.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-01-05 周六 16:15 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>I/O 重定向</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">

<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/blog/misc/style.css">
<!-- Global site tag (gtag.js) - Google Analytics -->



</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">I/O 重定向</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfd1941e">1. 前言</a></li>
<li><a href="#orgee78366">2. 概念</a></li>
<li><a href="#org87ff4e3">3. 系统级实现</a></li>
<li><a href="#org374a2c0">4. 简单的使用</a></li>
<li><a href="#orgb33489b">5. 用户级实现</a></li>
<li><a href="#org349ff2f">6. 结语</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgfd1941e" class="outline-2">
<h2 id="orgfd1941e"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>I/O 重定向</b> 算是一个灰常简单的概念，《深入理解计算机系统》这本书中对它的讲解不到一页，
但依然很清楚的说明了 <b>I/O 重定向</b> 是怎么一回事。
</p>

<p>
当时感觉很简单，也就没在意，今天感觉可以来尝试一下，毕竟，这个东东看起来还是很有趣的。
</p>
</div>
</div>

<div id="outline-container-orgee78366" class="outline-2">
<h2 id="orgee78366"><span class="section-number-2">2</span> 概念</h2>
<div class="outline-text-2" id="text-2">
<p>
通常情况下，操作系统内部使用小的非负整数 <b>文件描述符</b> 来标识打开的文件，一切对文件的操作都是通过 <b>文件描述符</b> 来完成的。
</p>

<p>
一般来说，两个不同的 <b>文件描述符</b> 标识的是不同的文件，比如：描述符 <code>0</code> 标识 <b>标准输入</b>, <code>1</code> 标识 <b>标准输出</b>.
</p>

<p>
而 <b>I/O 重定向</b> 操作，就是将一个 <b>文件描述符</b> 标识的文件替换为另一个文件。
</p>
</div>
</div>

<div id="outline-container-org87ff4e3" class="outline-2">
<h2 id="org87ff4e3"><span class="section-number-2">3</span> 系统级实现</h2>
<div class="outline-text-2" id="text-3">
<p>
很明显，重定向的操作需要修改操作系统内部的数据结构，而作为操作系统使用者的我们，是无法直接操作操作系统内部的数据结构的。
</p>

<p>
要实现真正意义上的 <b>I/O 重定向</b>, 就只能通过 <b>系统调用</b> 来完成。
</p>

<p>
在 <code>Unix/Linux</code> 系统中，可以通过如下函数完成 <b>I/O 重定向操作</b>:
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">dup2</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">oldfd</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">newfd</span>);
</pre>
</div>

<p>
这个函数将 <code>newfd</code> 标识的文件替换为 <code>oldfd</code> 标示的文件，操作成功后，描述符 <code>oldfd</code> 和 <code>newfd</code> 两个描述符标识的文件就是同一个文件了。
</p>

<p>
如果 <code>newfd</code> 标识的文件未关闭， <code>dup2</code> 还会贴心的帮你把它关上。
</p>

<p>
可以简单看一下这个函数的实现：
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">dupfd</span>(<span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">fd</span>, <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">arg</span>)
{
  ...
  (current-&gt;filp[arg] = current-&gt;filp[fd])-&gt;f_count++;
  <span style="font-weight: bold;">return</span> arg;
}

<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">sys_dup2</span>(<span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">oldfd</span>, <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">newfd</span>)
{
  sys_close(newfd);
  <span style="font-weight: bold;">return</span> dupfd(oldfd,newfd);
}
</pre>
</div>

<p>
可以看到，调用 <code>dup2</code> 后会首先关闭 <code>newfd</code> 标识的文件，然后在 <code>dupfd</code> 函数中：
</p>
<div class="org-src-container">
<pre class="src src-C">(current-&gt;filp[arg] = current-&gt;filp[fd])-&gt;f_count++;
</pre>
</div>

<p>
将 <code>flip[arg]</code> 标识的文件替换为 <code>flip[fd]</code> 标识的文件。
</p>

<p>
完整的源码链接： <a href="https://github.com/yuanxinyu/Linux-0.11/blob/c2e45a7f55ba61029be3b74cd7e72f23bbd068d6/fs/fcntl.c#L18">Linux-0.11/fs/fcntl.c#L18</a>.
</p>
</div>
</div>

<div id="outline-container-org374a2c0" class="outline-2">
<h2 id="org374a2c0"><span class="section-number-2">4</span> 简单的使用</h2>
<div class="outline-text-2" id="text-4">
<p>
在 <code>Shell</code> 中，通过管道命令 <code>|</code> 可以将上一个命令的 <b>标准输出</b> 重定向为下一个命令的 <b>标准输入</b>.
</p>

<p>
相应的，我们可以在程序内部重定向 <b>标准输出</b> 到 <b>文件</b>:
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;stdio.h&gt;</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;sys/types.h&gt;</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;sys/stat.h&gt;</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;fcntl.h&gt;</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;unistd.h&gt;</span>

<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">main</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">argc</span>, <span style="font-weight: bold; text-decoration: underline;">char</span>* <span style="font-weight: bold; font-style: italic;">argv</span>[]) {
  <span style="font-weight: bold; text-decoration: underline;">char</span> <span style="font-weight: bold; font-style: italic;">input</span>[100] = {0};

  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">fd</span> = open(<span style="font-style: italic;">"out.txt"</span>, O_RDWR|O_CREAT, S_IRUSR|S_IWUSR);
  dup2(fd, 1);

  fgets(input, 100, stdin);  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#20174;&#26631;&#20934;&#36755;&#20837;&#33719;&#21462;&#36755;&#20837;</span>
  printf(<span style="font-style: italic;">"%s"</span>, input);  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#36755;&#20986;&#21040;&#26631;&#20934;&#36755;&#20986;</span>

  close(fd);
  <span style="font-weight: bold;">return</span> 0;
}
</pre>
</div>

<p>
上述代码将得到的部分标准输入重定向到文件 <code>out.txt</code>, 当然，这并没有什么意义，
毕竟，完全可以用 <code>&gt;</code> 操作符代替。
</p>
</div>
</div>

<div id="outline-container-orgb33489b" class="outline-2">
<h2 id="orgb33489b"><span class="section-number-2">5</span> 用户级实现</h2>
<div class="outline-text-2" id="text-5">
<p>
对一般用户来说，重定向的具体实现是怎样的没有多大意义，只要结果正确就行了。
</p>

<p>
系统级的实现需要用到 <b>文件描述符</b> 这个非负整数值，而高级语言的标准输入输出库中的文件对象通常都不是这个整数值。
</p>

<p>
因此，与其使用 <code>dup2</code> 这种 <b>系统级</b> 的 <b>I/O 重定向</b> 实现，不如简单一点，直接替换 <b>文件对象</b> 的引用就行了。
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="font-weight: bold;">import</span> sys
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">sys.stdout</span> = <span style="font-weight: bold;">open</span>(<span style="font-style: italic;">'out.txt'</span>, <span style="font-style: italic;">'w'</span>)
&gt;&gt;&gt; sys.stdout.fileno()

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">$  cat out.txt</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">3</span>
</pre>
</div>

<p>
在 <code>Python</code> 中，像上面那样，替换了 <code>stdout</code> 后，虽然不是将描述符 <code>1</code> 标识的文件替换为 <code>out.txt</code>, 但执行结果上，
效果是一样的。
</p>

<p>
<b>Tips</b>: <code>C</code> 语言中可以用 <code>freopen()</code> 替换标准 <code>I/O</code> 流。
</p>
</div>
</div>

<div id="outline-container-org349ff2f" class="outline-2">
<h2 id="org349ff2f"><span class="section-number-2">6</span> 结语</h2>
<div class="outline-text-2" id="text-6">
<p>
对系统底层的了解越多，就越能感受到现在的高级语言为我们提供了多少便利。
</p>

<p>
前人栽树后人乘凉啊！
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
版权声明:自由转载-非商用-非衍生-保持署名(<a href="http://creativecommons.org/licenses/by-nc-nd/3.0/deed.zh">创意共享3.0许可证</a>)
<div id="disqus_thread"></div>
<script type="text/javascript">
  var disqus_shortname = 'rgb-24bit';
  (function() {
    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
  })();
</script>
</div>
</body>
</html>
